tap "blendle/blendle"
tap "bufbuild/buf"
tap "cmacrae/formulae"
tap "dart-lang/dart"
tap "epk/epk"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "leoafarias/fvm"
tap "stripe/stripe-cli"
tap "teamookla/speedtest"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Postgres C API library
brew "libpq", link: true
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# File comparison utilities
brew "diffutils"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Audit git repos for secrets
brew "gitleaks"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Database migrations CLI tool
brew "golang-migrate"
# Language server for the Go language
brew "gopls"
# Multimedia framework for research and academic purposes
brew "gpac"
# GNU grep, egrep and fgrep
brew "grep"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Development kit for the Java programming language
brew "openjdk"
# Dex to Java decompiler
brew "jadx"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# C and C++ client library to the memcached server
brew "libmemcached"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
# brew "openjdk@11"
# Reads MySQL binlogs and writes row updates as JSON to Kafka
brew "maxwell"
# Replacement for the old crypt package and crypt(1) command
brew "mcrypt"
# Open source relational database management system
brew "mysql-client"
# Text-based UI library
brew "ncurses"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node@20"
# Development kit for the Java programming language
brew "openjdk@17"
# Development kit for the Java programming language
# brew "openjdk@21"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Rsync for cloud storage
brew "rclone"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Editor of encrypted files
brew "sops"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Manage the desktop wallpaper
brew "wallpaper"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# HTTP benchmarking tool
brew "wrk"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# GPU-accelerated terminal emulator
cask "alacritty"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# Server and cloud storage browser
cask "cyberduck"
# Client for the Dropbox cloud storage service
cask "dropbox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-cascadia-mono"
cask "font-cascadia-mono-nf"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Go (golang) IDE
cask "goland"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Tool to optimise images to a smaller size
cask "imageoptim"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Shows the next meeting in the menu bar
cask "meetingbar"
# PHP IDE by JetBrains
cask "phpstorm"
# Colour picker for colours onscreen
cask "pika"
# Collaboration platform for API development
cask "postman"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin to view patch files
cask "qlprettypatch"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Text editor for code, markup and prose
cask "sublime-text"
# Native GUI tool for relational databases
cask "tableplus"
# Unpacks archive files
cask "the-unarchiver"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# JavaScript IDE
cask "webstorm"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "HP Smart", id: 1474276998
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Slack", id: 803453959
mas "SmartDNSProxy", id: 1471096079
mas "Spark", id: 1176895641
mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "chukwuamaka.csvtojson-converter"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "janisdd.vscode-edit-csv"
vscode "kangping.protobuf"
vscode "meezilla.json"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "pkief.material-icon-theme"
vscode "planbcoding.vscode-react-refactor"
vscode "rangav.vscode-thunder-client"
vscode "robert-brunhage.flutter-riverpod-snippets"
vscode "samuelcharpentier.remove-non-ascii-chars"
vscode "tamasfe.even-better-toml"
vscode "thinker.copy-as-snippet"
vscode "weekit.flutter-assets-gen2"
vscode "zhuangtongfa.material-theme"
