tap "blendle/blendle"
tap "cmacrae/formulae"
tap "epk/epk"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Dependency manager for Cocoa projects
brew "cocoapods"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Language server for the Go language
brew "gopls"
# GNU grep, egrep and fgrep
brew "grep"
# OpenType text shaping engine
brew "harfbuzz"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# C and C++ client library to the memcached server
brew "libmemcached"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# High performance, distributed memory object caching system
brew "memcached"
# Terminal-based visual file manager
brew "midnight-commander"
# Open source relational database management system
brew "mysql-client"
# Text-based UI library
brew "ncurses"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# General-purpose scripting language
brew "php@7.4"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Manage the desktop wallpaper
brew "wallpaper"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# In terminal graphical metrics for your *nix system
brew "zenith"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# GPU-accelerated terminal emulator
cask "alacritty"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# Utility that prevents the system from going to sleep
cask "caffeine"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Go (golang) IDE
cask "goland"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Keyboard customizer
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# App to write, plan, collaborate, and get organized
cask "notion"
# PHP IDE by JetBrains
cask "phpstorm"
# Colour picker for colours onscreen
cask "pika"
# Collaboration platform for API development
cask "postman"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlprettypatch"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# QuickLook plugin for CSV files
cask "quicklook-csv"
# QuickLook plugin for JSON files
cask "quicklook-json"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# System monitor for the menu bar
cask "stats"
# Text editor for code, markup and prose
cask "sublime-text"
# Native GUI tool for relational databases
cask "tableplus"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Unpacks archive files
cask "the-unarchiver"
# Open-source code editor
cask "visual-studio-code"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "ColorSlurp", id: 1287239339
mas "Edison Mail", id: 1489591003
mas "Slack", id: 803453959
mas "TickTick", id: 966085870
mas "Xcode", id: 497799835
